import os
from rich.panel import Panel
from rich import print as Print
class Basic_Things:
	def PRINT():
		help ="""ما هو الامر print؟
\x1b[91m
الامر print يُترجم الى طبع او طباعة 
يستخدم هذا الامر الى طباعة الاشياء 

\x1b[94m═════════════════════════
\x1b[92m
وكيف ااستعمله بالطريقة الصحيحه؟

يمكنك استعماله بالطريقة الصحيحه عبر هذه الخطوات : 
1 كتابة الامر print()
2 بداخل الاقواس تقوم بوضع علامة الاقتباس  للكلمات النصية
وعلامة الاقتباس تكون مثل هذا "" او ''

\x1b[94m═════════════════════════
\x1b[92m
لنأخذ مثال:

print("hello world !")
او 
print ("hello world !")
او
print ('hello world !')
عند كتابة هذا الكود و تشغيل البرنامج
سوف يقوم بطباعة كلمة

hello world ! 

الموجودة بداخل علامة الاقتباس
\x1b[94m═════════════════════════\x1b[92m
مثال اخر :
لجمع ارقام
print (1 + 2)

عند تشغيل الكود سوف يقوم بطباعة رقم 3
لان ناتج جمع 1 و 2 هو 3

اما اذا اردنا ان نطبع 1 +2 
نقوم بوضع علامة الاقتباس 
مثل هذا

print ("1 + 2")

عند تشغيل الكود سوف يقوم بطباعة 
1 + 2
من دون جمعها لان علامة الاقتباس تقوم بجعله كلمة نصية و ليس رقم 

\x1b[94m═════════════════════════\x1b[91m

الرموز الخاصة:

هي عبارة عن رموز تستطيع استخدامها لتسهيل البرمجة

والرموز الخاصة هي:

\\n = سطر جديد

\\t = اربع مسافات

\\r = رجوع الكلمة

\\ = تستخدم لتهريب الكلمة

\x1b[92m
الامثلة:

#\\n
print ("Hi \\n Ahmed")

او
print("Hi\\nAhmed")
النتيجة:

Hi
Ahmed

\x1b[93m───────────────────
\x1b[92m

#\\t
print ("Hi \\t Zain")
او
print("Hi\\tZain")
النتيجة:

Hi	  Zain

\x1b[93m───────────────────
\x1b[92m

#\\r
print ("H\\r HEllo")

النتيجة:

HEllo

لان كلمة
HEllo
اكثر طولآ من H

\x1b[93m───────────────────
\x1b[92m

#\\
print( 'I can't do this' )

عند تشغيل الكود سوف يظهر خطأ 
والحل؟
الحل باستخدام  رمز التهريب

هكذا:

print ( 'I can\'t do this ' )

النتيجة:

I can't do this

ويمكنك استخدام علامة اقتباس مختلفة حتى تتجنب الخطاء هذا

مثل

print (" I can't do this ")
وهذا يعمل بدون خطاء لان علامة الاقتباس مختلفة فلا يحدث قطع في علامة الاقتباس

ويوجد علامة اقتباس مختلفة
وهي 
ان توضع ثلاث مرات من علامة اقتباس متشابه 

\x1b[94m═════════════════════════\x1b[93m
ملاحظة: تستطيع استخدامها مع المتغير ات مثل

k = 1 +2 

او

l = "1 + 2"

سوف تفهمها عندما تتعلم المتغيرات

الان استعمل الامر print مع كلمة مختلفه 

"""
		print(help)
	def for_while(type=1):
		help_for = """ما هو الـ for؟

\x1b[91mهي عبارة عن اعادة تكرار العملية اكثر من مرة 
\x1b[94m═════════════════════════
\x1b[91m
اين يمكنني استخدامها؟

  يمكننك استخدامها حتى تستطيع ان تطبع كلمة معينه اكثر من 100 مرة او كتابة احرف الجمله واحد  واحد
من دون كتابة الامر print 

\x1b[94m═════════════════════════
\x1b[92m
طريقة الاستعمال : 

for i in range (10) :
	print ("العراق")

توضيح الكود
for = اعادة تكرار العملية

i = متغير عشوائي يمكنك وضع اي شي ما عدى
الكلمات المحجوزة في اللغة مثل 
print , def , for , while , import ,in ,and ,or وغيرها

in = في داخل

range = الطول
range (10) = الطول او العدد هو 10

وعند تنفيذ البرنامج سوف يقوم بطباعة كلمة العراق 
10 مرات 
افضل من كتابة الامر print 10 مرات

\x1b[94m═════════════════════════
\x1b[92m
مثال اخر:

for i in "Zain" :
	print( i )

توضيح الكود : 
"Zain" = نص سوف تفهمه عندما تتعلم المتغيرات

حسنآ ولكن لماذا تطبع i بدون علامة الاقتباس
نحن تعلمنا ان يجب وضع علامة اقتباس لطباعة الكلمة
ولكن هذا ليس كلمة بل هو متغير فالمتغير عندما 
نريد طباعتة يجب عدم وضع علامة اقتباس وسوف نتعلمها لاحقآ

النتيجة:
Z
a
i
n

\x1b[94m═════════════════════════
\x1b[93m
قم بتجربة اشياء مختلفه عن الامثلة 
ڪي تصبح قويآ بها
"""
		help_while="""ما هو الـ while؟
\x1b[91mهو شبيه لـ for ولكنه مختلف قليلآ
كيف مختلف؟
لا يوجد فيه شي اسمه i in range
او 
_ in "Ahmed" 
وغيرها

بل يوجد فيهاTrue و False و الشروط 
وسوف تفهمها في الامثلة
\x1b[94m═════════════════════════
\x1b[92m
مثال:

while True:
	print ("Iraq number one")
	
توضيح الكود:
while = حلقة التكرار
True = بمعنى صحيح يعني لا تتوقف 

النتيجة:
يقوم بطباعة كلمة Iraq number one الى ما لا نهاية 

\x1b[94m═════════════════════════
\x1b[92m
مثال اخر:

while 1==1:
	print(' GOOD BOY')

توضيح الكود:
while = حلقة التكرار
1==1 = هل 1 يساوي 1
النتيجة هي True يعني اي يساوي 1

النتيجة:
كذالك يقوم بطباعة كلمة GOOD BOY
الى  ما لا نهاية
\x1b[94m═════════════════════════
\x1b[93m
قم بفعل اشياء غير عن الامثلة مثل استخدام الـ False
او شروط ثانيه 
مثل 
2 !=1

"""
		if type ==1:
			print(help_for)
		else:
			print(help_while)
	def var():
		help = """
ما هو المتغير؟
\x1b[91m
هو عبارة عن صندوق فارغ يمكنك استدعائه متى ما شئت و يمكنك تغير قيمته

وكذالك تستطيع تسميت المتغير بأي أسم 
ما عدا الكلمات المحجوزة لـ لغة بايثون 
\x1b[94m═════════════════════════
\x1b[92m
طريقة الاستعمال:

a ="zain" 
print( a )

توضيح الكود:

متغير بأسم a  
قيمته هي "zain"

ملاحظة:
عند طباعة المتغير يجب عدم استعمال علامة الاقتباس او استخدام format

\x1b[94m═════════════════════════
\x1b[92m]
مثال:

a = "Aoele jesus"
print(a)

النتيجة:

Aoele jesus

قام بطباعة قيمة المتغير 

\x1b[94m═════════════════════════
\x1b[92m
مثال اخر:
بأستعمال format

ASK = "Suuuu"
print (f"{ASK} is for cr7")

توضيح الكود:
ASK = متغير
f"{ASK} is for cr7"
f = format
تستخدم ڪي اقدر ان اطبع المتغير مع نص اخر سويتآ
{} = لجلب قيمة المتغير

النتيجة:

Suuuu is for cr7

اذا اكثر من متغير

O = "1"
KK ="2"
print (f"{O} and {KK} is good number")

النتيجة:

1 and 2 is good number

\x1b[94m═════════════════════════
\x1b[92m
مثال اخر:

وبأستعمال .format

O = "khali 3la kefk"
print ("{} , roo7 shd ".format(O,))

اذا اكثر من متغير

O = "1"
K ="2"
print("{} and {} is the best number".format(O,K))

توضيح الاكواد:

.format = مثل f 

النتيجة:
1 and 2 is the best number

\x1b[94m═════════════════════════
\x1b[92m

العمليات الحسابية في المتغيرات مثل الجمع او الطرح و غيرها

لمعرفة رموز العمليات الحسابية ارجع الى القائمة
واختار الرقم 6

الامثلة:
\x1b[93m───────────────────
\x1b[92m

الجمع

بأستعمال اكثر من متغير 

a = 14
n = 2
print ( a + n)

النتيجة
16

او 

بأستعمال متغير واحد

a = 20 + 20
print(a)

النتيجة:

40

\x1b[93m───────────────────
\x1b[92m

الطرح

بأستعمال اكثر من متغير 

a = 10
l = 5
print (a - l)

النتيجة
5

او

بأستعمال متغير واحد

a = 50 - 20
print(a)

النتيجة
30

\x1b[94m═════════════════════════\x1b[92m

العمليات الحسابية مع النصوص
- نستخدم الـ format ڪي نقوم باضافة عملية حسابية مع نصوص

الامثلة
\x1b[93m───────────────────
\x1b[92m

باستخدام  f

الجمع

اكثر من متغير 

g = 2
k = 5
print(f'Results : {g+k}')

النتيجة:
Results : 7

او

متغير واحد

z = 10+20+50
print(f'{z} : Results')

النتيجة:

80 : Results

\x1b[93m───────────────────
\x1b[92m
مثال اخر

باستخدام .format

اكثر من متغير 

k = 4
n =2
print (" Result : {}".format(k+n))

النتيجة:
 Result : 6
متغير واحد

n = 4+7
print (" Results : {}".format(n))

النتيجة:

 Results : 11


\x1b[94m═════════════════════════\x1b[93m

قم بتجربة اشياء مختلفة عن الامثلة  ! 
"""
		print(help)
	def INPUT():
		help = """
ما هو الـ input؟

\x1b[91m

هو طريقة لجعل المستخدم يدخل كلمات 
مثل ادخال ايدي او توكن
او سيشن و غيرها 
\x1b[92m
الامثلة:
\x1b[94m═════════════════════════\x1b[92m
مثال: من دون حفظ قيمة الادخال

input (" Enter your name")

عند تشغيل الكود سوف يطلب الكود ادخال كلمة
عند ادخال الكلمة و الضغط على 
انتر
سوف يتوقف من دون حفظ الذي كتبه المستخدم
وكذالك من دون طباعة ما كُتب

\x1b[93m───────────────────
\x1b[92m
مثال اخر : مع حفظ قيمة الادخال

g = input("Enter Your name : ")
عند التشغيل كذالك سوف يطلب من المستخدم ادخال كلمة وعند الضغط 
كذالك لا يطبع ما كتبه المستخدم ولكن
قام بحفظ قيمة الادخال في 
متغير اسمه
g

\x1b[93m───────────────────
\x1b[92m
مثال اخر: طباعة قيمة المتغير

name = input ("Enter Your name : ")

print (name)

عند التشغيل و ادخال كلمة سوف يقوم بطباعة قيمة المتغير وهي الشيء 
الذي قام بادخاله المستخدم

\x1b[93m───────────────────
\x1b[92m

مثال اخر: ادخال الارقام

S = int(input("Enter Number :"))
print (S +1)

توضيح الكود:

int() = دالة تقوم بتحويل النص الى رقم 
مثل
'1' = 1
'2' = 2

\x1b[94m═════════════════════════\x1b[92m

ملاحظة: الـ input
يستخدم لـاشياء كثيره ومهم جدآ جدآ


\x1b[94m═════════════════════════
\x1b[93m

قم بتجربة اشياء مختلفة عن الامثلة لتقوية مهاراتك😉


"""
		print(help)
	def symbolize():
		help = Panel("""
رموز العمليات الحسابية:
+ = جمع
 - = طرح
 * = ضرب
 ** = اسس
 / = قسمة
 // = قسمة صحيحه
 
ما يحتاج امثلة لان انت ذكي""")
		Print(help)
	def if_elif_else(type=1):
		
		help_if = """
ما هو الـ if؟
\x1b[91m
هو عبارة عن التحقق من شرط معين اذا تحقق الشرط يشغل شي معين  و يترجم بالعربي الى إذا

ويستخدم بكل شيء 

\x1b[94m═════════════════════════\x1b[92m
رموز الشروط

== 
يساوي

 != 
 لا يساوي
 
 >= 
 اكبر او يساوي
 تستخدم مع الارقام
 
 <=
 اصغر او يساوي 
 تستخدم مع الارقام
 <
 اصغر
 تستخدم مع الارقام
 >
 اكبر
 تستخدم مع الارقام
\x1b[94m═════════════════════════\x1b[92m

الامثلة
\x1b[93m───────────────────
\x1b[92m
مثال: 

k = "1"

if k == "1" :
	print ("Yes")

توضيح الكود
if  = اذا
k == "1" = اذا المتغير يساوي "1"
: = الاكواد المطلوب تنفيذها اذا تحقق الشرط
print = اطبع

عند تشغيل الكود
سوف يتحقق هل المتغير يساوي النص واحد
اذا يساوي 
يطبع Yes

\x1b[93m───────────────────
\x1b[92m
مثال اخر:

if 1 != 3:
	print ("Yes")

ترجمة الكود
اذا 1 لا يساوي 3 اطبعلي 
Yes

\x1b[93m───────────────────
\x1b[92m
مثال اخر: تحقق من الباسورد للاداة 

password = "i_love_zain"

the_user = input("Enter the password => ")
if the_user != password:
	print ("الباسورد غير صحيح")

ترجمة الكود:
متغير password
قيمته هي i_love_zain

the_user = متغير لحفظ القيمة التي سوف يكتبها المستخدم

if the_user != password:
	print ("الباسورد غير صحيح")

اذا المتغير ذي_يوزر لا يساوي متغير الباسورد
اطبعلي الباسورد غير صحيح
\x1b[93m───────────────────
\x1b[92m
مثال اخر:

print (" 1 = carrot\\n 2 = apple ")

user = input("Enter Number to eat it ==>")

if user in '1':
	print("You eating a carrot")
if user in '2':
	print ("You eating a apple")

توضيح الكود

الشرط الاول:
اذا user موجود بيه 1
اطبعلي You eating a carrot

الشرط الثاني:
اذا user موجود بيه 2
اطبعلي
You eating a apple


\x1b[94m═════════════════════════\x1b[93m

جرب اشياء مختلفة لتقوية علاقتك بها 😉

"""
		help_else="""
ما هو الـ else؟

\x1b[91m
اذا لم يتحقق أي شرط تقوم بتشغيل شرط معين

\x1b[94m═════════════════════════\x1b[92m
مثال

if 1 !=1:
	print ("لا يساوي")
else:
	print ("يساوي ")

ترجمة الكود:
if 1 !=1:
	print ("لا يساوي")

اذا 1 لا يساوي 1:
	اطبع لا يساوي

else:
	print ("يساوي")
اذا ما تحقق الشرط :
	اطبع يساوي
\x1b[93m───────────────────
\x1b[92m
مثال اخر:

if input("Enter the password =>") == "Hi":
	print ("Correct")
else:
	print ("Not Correct")

ترجمة الكود
if input("Enter the password =>") == "Hi":
	print ("Correct")

اذا الكلمة الي دخلها المستخدم تساوي 
Hi :
	اطبع Correct

اذا ما تحقق الشرط:
	اطبع Not Correct
\x1b[94m═════════════════════════\x1b[93m

جرب طرق مختلفة لتعجب بها😉
"""
		help_elif ="""
elif 

\x1b[91m
هي اختصار لـ 
else if
يعني اذا ما تحقق هذا الشرط شوف هذا الشرط الثاني 
اذا تحقق الشرط يسوي تجاهل لبقية الشروط 
واذا لم يتحقق يشوف بقية الشروط

\x1b[94m═════════════════════════\x1b[92m
الامثلة:

\x1b[93m───────────────────
\x1b[92m
مثال:تقدير درجتك

deg = int(input("ادخل درجتك :"))

if deg >=90:
	print ("ممتاز !")
elif deg >=80:
	print ("جيد جدآ")
elif deg >=70:
	print ("جيد")
elif deg >=60:
	print("احسنت")
elif deg >=50:
	print("همممم")
else:
	print("راسب يا كسولي")

\x1b[93m───────────────────
\x1b[92m
مثال اخر

Asd = "1 = Insta\\n2 = tiktok \\n3= snapchat"
print(Asd)
user = input("Enter number ==>")

if user =='1':
	print("This my user : 4p_ru3")

elif user =='2':
	print(" This my user : hnmg")
elif user =='3':
	print(" I don't have snapchat")
else:
	print("Choice 1 or 2 or 3")

\x1b[94m═════════════════════════\x1b[93m

جرب اكواد جديده انت تصنعها بنفسك
"""
		if type ==1:
			print(help_if)
		elif type ==2:
			print(help_elif)
		elif type ==3:
			print(help_else)
		else:
			print("Not in the list !")
menu = Panel("""
\x1b[92m[1] = print
\x1b[92m[2] = variable 
\x1b[92m[3] = for 
\x1b[92m[4] = while
\x1b[92m[5] = input
\x1b[92m\r[6] ar = \rرموز العمليات الحسابيه
\x1b[92m[7] = if,elif,else
""",title="Py",border_style="red")
def Main():
	Print(menu)
	print("\x1b[35m ادخل الرقم الذي تريد ان تتعلمه \nومن الافضل ان تبدأ بالتدريج\n")
	My_baby = input("==> \x1b[39m")
	os.system('clear')
	if My_baby in '1':
		Basic_Things.PRINT()
	elif My_baby in '2':
		Basic_Things.var()
	elif My_baby in '3':
		Basic_Things.for_while(type=1)
	elif My_baby in '4':
		Basic_Things.for_while(type=2)
	elif My_baby in '5':
		Basic_Things.INPUT()
	elif My_baby in '6':
		Basic_Things.symbolize()
	elif My_baby in '7':
		Print(Panel("""
1 = if
2 = elif
3 = else
"""))
		print("اختر الرقم الذي تريد تتعلمه")
		user = input("==>\x1b[39m")
		if user in '1':
			type = 1
		elif user in '2':
			type =2
		elif user in '3':
			type =3
		else:
			type =1
		os.system("clear")
		Basic_Things.if_elif_else(type=type)
Main()